mathblog/2026_goals.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-07 Sat 08:09 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>An update and some goals for 2026</title>
<meta name="author" content="Jack Ceroni" />
<meta name="description" content="Goals!" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">An update and some goals for 2026</h1>
<p>
<i>Originally posted:</i> February XX, 2026
</p>

<hr />

<p>
This will be the first-ever post on this blog which is not wholly dedicated to proving theorems and/or solving math problems. Hopefully, it will be the first of many! I
never intended for this blog to be wholly math-focused, but alas, this is the subject about which I spend 99% of my time thinking. I still have my Substack, where I plan
to release long-form writing like book reviews, essays, and perhaps even some short stories. I see the blog as a more personal forum, where I can just talk about my life
in a more stream-of-concious way. Naturally, it isn't <i>maximally</i> personal: after all it is still public, but its digital location ensures that it is slightly more
secluded than <i>Dark Star</i> (my Substack).
</p>

<p>
In this transitory period of my life, where I'm shifting my mindset away from playing "the game" associated with getting the best marks in university classes, being constantly stressed
about problem sets/assignments/exams, and in turn receiving clear signals about my performance in the form of number grades. I've sort of always known that this isn't how the real world
works, but for the past 4 years and change, I have cultivated an identity which is highly correlated with academic performance: when I do well, I feel normal, when I do poorly, I feel awful,
and when there is no doing to do (i.e. I go through a period where I'm <i>not</i> chasing the North star of outstanding marks), I feel aimless. It has become very clear to me that I need to make
some changes, but of course, it is often the case that there is misalignment between the mind and the heart. The remedy to this situation seems to be deep reflection about what I actually
want in life, and <i>why</i> I am currently doing what I am. I do strongly believe that I am doing a PhD for the right reasons: I love mathematics
</p>

<ul class="org-ul">
<li>I want to become very good at Riemannian geometry. The way I'm planning on accomplishing this is by doing a large portion of the problems
in Lee and/or Petersen's books. I'm also planning on reading Colding and Minicozzi's book on minimal surfaces, and Morgan and Tian's book on
the Poincare conjecture. This will require also becoming knowledgable about PDEs.</li>
<li>I want to understand probability theory and stochastic calculus very well. The main resources I'm currently using are Zitkovic's lecture notes,
and I'll eventually move on to Le Gall's book.</li>
<li>On that note, I'd like to understand financial mathematics well, to the point where I'm able to read the current state-of-the-art research/have novel ideas</li>
<li>Same thing goes for the more advanced mathematical quantum theory (in the sense of R.I. Sigal's work in this area). I want to be able to read his papers and have ideas for extensions.</li>
<li>I'd also like to learn way more about symplectic topology. I'm planning on doing the exercises in McDuff and Salamon's book.</li>
<li>Finally, I'd like to take a look at optimal transport (perhaps Villani's book) after I become very comfortable with probability.</li>
</ul>

<p>
That seems like more than enough to keep me busy, for the time being.
</p>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jack Ceroni</p>
<p class="date">Created: 2026-02-07 Sat 08:09</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
